# Pandas DataFrame Oluşturma

pd.DataFrame()

* DataFrame oluşturabiliriz.
* columns parametresi ile kolon isimlerini belirleyebiliriz.
* index parametresi ile index isimlerini belirleyebiliriz.

In [7]:
import pandas as pd
import numpy as np

s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [8]:
sozluk = {"var1" : s1, "var2" : s2, "var3" : s3}
df = pd.DataFrame(sozluk)

In [9]:
df

   var1  var2  var3
0     7     3     1
1     5     0     0
2     7     9     6
3     9     6     4
4     7     1     7

In [10]:
df[0:1]

   var1  var2  var3
0     7     3     1

In [11]:
df.index = ["a","b","c","d","e"]

In [12]:
df

   var1  var2  var3
a     7     3     1
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [13]:
df[0:1]

   var1  var2  var3
a     7     3     1

In [14]:
df["c":"e"]

   var1  var2  var3
c     7     9     6
d     9     6     4
e     7     1     7

* df.drop() ile kolon veya satır silme işlemi yapabiliriz.
* axis=1 ile kolon silme işlemi yapabiliriz.
* axis=0 ile satır silme işlemi yapabiliriz.

In [15]:
df.drop("a",axis=0)

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [16]:
df

   var1  var2  var3
a     7     3     1
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

inplace parametresi ile değişikliği kalıcı kaydetme işlemi yapabiliriz. Diğer durumlarda değişiklikler geçici olarak kaydedilir.

In [17]:
df.drop("a",inplace=True)

In [18]:
df

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [19]:
l = ["var1","var2","var3"]
for i in l:
    print(i in l)

True
True
True

In [23]:
df["var4"] = df["var1"] / df["var2"]
df

   var1  var2  var3      var4
b     5     0     0       inf
c     7     9     6  0.777778
d     9     6     4  1.500000
e     7     1     7  7.000000

In [27]:
df["var4"] = df["var1"] / df["var2"]
df.drop("var4",axis=1,inplace=True)
df

   var1  var2  var3
b     5     0     0
c     7     9     6
d     9     6     4
e     7     1     7

In [29]:
l = ["var1","var2"]
df.drop(l,axis=1)

   var3
b     0
c     6
d     4
e     7

# Gözlem ve Değişken Seçimi

In [6]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30,size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    29    19    19
1    12    25    24
2    15     8    10
3    21    24     4
4    17    21    28
5     1    10    25
6    16     6    21
7     5    25     6
8     9    15    17
9    17     7     9